namespace VRageMath
{
    using ProtoBuf;
    using System;
    using System.Diagnostics;
    using System.Globalization;
    using System.Reflection;
    using System.Runtime.CompilerServices;
    using System.Runtime.InteropServices;
    using Unsharper;

    [Serializable, StructLayout(LayoutKind.Explicit), ProtoContract]
    public struct Matrix : IEquatable<Matrix>
    {
        public static Matrix Identity;
        public static Matrix Zero;
        [FieldOffset(0)]
        private F16 M;
        [ProtoMember(0x25), FieldOffset(0)]
        public float M11;
        [ProtoMember(0x2b), FieldOffset(4)]
        public float M12;
        [ProtoMember(0x31), FieldOffset(8)]
        public float M13;
        [ProtoMember(0x37), FieldOffset(12)]
        public float M14;
        [ProtoMember(0x3d), FieldOffset(0x10)]
        public float M21;
        [ProtoMember(0x43), FieldOffset(20)]
        public float M22;
        [ProtoMember(0x49), FieldOffset(0x18)]
        public float M23;
        [ProtoMember(0x4f), FieldOffset(0x1c)]
        public float M24;
        [ProtoMember(0x55), FieldOffset(0x20)]
        public float M31;
        [ProtoMember(0x5b), FieldOffset(0x24)]
        public float M32;
        [ProtoMember(0x61), FieldOffset(40)]
        public float M33;
        [ProtoMember(0x67), FieldOffset(0x2c)]
        public float M34;
        [ProtoMember(0x6d), FieldOffset(0x30)]
        public float M41;
        [ProtoMember(0x73), FieldOffset(0x34)]
        public float M42;
        [ProtoMember(0x79), FieldOffset(0x38)]
        public float M43;
        [ProtoMember(0x7f), FieldOffset(60)]
        public float M44;

        static Matrix()
        {
            Identity = new Matrix(1f, 0f, 0f, 0f, 0f, 1f, 0f, 0f, 0f, 0f, 1f, 0f, 0f, 0f, 0f, 1f);
            Zero = new Matrix(0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f, 0f);
        }

        public Matrix(MatrixD other)
        {
            this.M11 = (float) other.M11;
            this.M12 = (float) other.M12;
            this.M13 = (float) other.M13;
            this.M14 = (float) other.M14;
            this.M21 = (float) other.M21;
            this.M22 = (float) other.M22;
            this.M23 = (float) other.M23;
            this.M24 = (float) other.M24;
            this.M31 = (float) other.M31;
            this.M32 = (float) other.M32;
            this.M33 = (float) other.M33;
            this.M34 = (float) other.M34;
            this.M41 = (float) other.M41;
            this.M42 = (float) other.M42;
